In [1]:
import mysql.connector

In [2]:
cn = mysql.connector.connect(

    host="localhost",
    user="root",
    password="root"
)

print(cn)

<mysql.connector.connection.MySQLConnection object at 0x0000022DEBE07AF0>

In [3]:
cr = cn.cursor()

In [13]:
cr.execute("create database organization")

In [5]:
#cr.execute("drop database employees")

In [4]:
cr.execute("show databases")

for val in cr:
    print(val)

('cis660',)
('information_schema',)
('mysql',)
('organization',)
('performance_schema',)
('previous',)
('sys',)

In [ ]:
cn = mysql.connector.connect(

    host="localhost",
    user="root",
    password="root",
    database = "organization"
)

In [5]:
cr.execute("use organization")

In [7]:
#cr.execute("drop table employees")

In [8]:
cr.execute('''
            create table employees(
                id int auto_increment primary key,
                name varchar(20),
                salary float,
                job_title varchar(20)
            )
''')

In [9]:
cr.execute("show tables")

for val in cr:
    print(val)

('employees',)

In [10]:
cr.execute("insert into employees (name, salary, job_title) values('Sam', 98000, 'Developer')")

In [12]:
query = "insert into employees (name, salary, job_title) values(%s, %s, %s)"

val = [('John', 100000, 'Web Designer'), ('Sarah', 125000, 'DBA'), ('Dave', '150000', 'Data Scientist')]

cr.executemany(query, val)

In [13]:
cr.rowcount

3

In [14]:
cn.commit()

In [11]:
cr.execute("select * from employees")

for val in cr:
    print(val)

(1, 'Sam', 98000.0, 'Developer')

In [16]:
cr.execute("select * from employees")

for val in cr:
    print(val)

(1, 'Sam', 98000.0, 'Developer')
(2, 'John', 100000.0, 'Web Designer')
(3, 'Sarah', 125000.0, 'DBA')
(4, 'Dave', 150000.0, 'Data Scientist')

In [ ]:
cr.execute("select * from employees limit 3")

for val in cr:
    print(val)

In [22]:
cr.execute("select name, job_title from employees")

for val in cr:
    print(val)

('Sam', 'Developer')
('John', 'Web Designer')
('Sarah', 'DBA')
('Dave', 'Data Scientist')

In [18]:
cr.execute("select * from employees")

result = cr.fetchone()

print(result)

(1, 'Sam', 98000.0, 'Developer')

In [21]:
'''
for val in cr:
    print(val)
'''

(2, 'John', 100000.0, 'Web Designer')
(3, 'Sarah', 125000.0, 'DBA')
(4, 'Dave', 150000.0, 'Data Scientist')

In [23]:
cr.execute("select * from employees where salary <=100000")

for val in cr:
    print(val)

(1, 'Sam', 98000.0, 'Developer')
(2, 'John', 100000.0, 'Web Designer')

In [25]:
cr.execute("select * from employees where job_title like '%er%' ")
for val in cr:
    print(val)

(1, 'Sam', 98000.0, 'Developer')
(2, 'John', 100000.0, 'Web Designer')

In [31]:
cr.execute("select * from employees order by salary desc")
for val in cr:
    print(val)

(4, 'Dave', 150000.0, 'Data Scientist')
(2, 'John', 100000.0, 'Web Designer')
(1, 'Sam', 98000.0, 'Developer')

In [28]:
cr.execute("update employees set salary = 135000 where id=3 ")
cn.commit()

In [30]:
cr.execute("delete from employees where id=3 ")
cn.commit()

In [35]:
cr.execute("drop table if exists employees")

In [36]:
cr.execute("drop database organization")